In [74]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from word2number import w2n

In [110]:
df=pd.read_csv('hiring.csv')
df

  experience  test_scores  interviews  salary
0        NaN          8.0           9   50000
1        NaN          8.0           6   45000
2       five          6.0           7   60000
3        two         10.0          10   65000
4      seven          9.0           6   70000
5      three          7.0          10   62000
6        ten          NaN           7   72000
7     eleven          7.0           8   80000

In [111]:
df.experience=df.experience.fillna('zero')
median=df.test_scores.median()
df.test_scores=df.test_scores.fillna(median)

In [112]:
df

  experience  test_scores  interviews  salary
0       zero          8.0           9   50000
1       zero          8.0           6   45000
2       five          6.0           7   60000
3        two         10.0          10   65000
4      seven          9.0           6   70000
5      three          7.0          10   62000
6        ten          8.0           7   72000
7     eleven          7.0           8   80000

In [98]:
#tf=df.experience.to_string()
tf=df.experience.astype(str)
tf

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [113]:
w_to_num=[]
for i in tf:
    temp=w2n.word_to_num(i)
    w_to_num.append(temp)

df.experience=pd.DataFrame(w_to_num)
df

   experience  test_scores  interviews  salary
0           0          8.0           9   50000
1           0          8.0           6   45000
2           5          6.0           7   60000
3           2         10.0          10   65000
4           7          9.0           6   70000
5           3          7.0          10   62000
6          10          8.0           7   72000
7          11          7.0           8   80000

In [107]:
from sklearn import linear_model

In [114]:
reg=linear_model.LinearRegression()
reg.fit(df[['experience','test_scores','interviews']],df.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [115]:
reg.predict([[2,9,6]])

array([53205.96797671])

In [116]:
reg.predict([[12,10,10]])

array([92002.18340611])